



















* log all syntax output
** DONE first hello world
   CLOSED: [2020-05-01 Fri 07:20]


** TODO understand descendant nodes and child nodes
   - childs are the immediate ones,
   - still don't fully get the descendants though
   :LOGBOOK:
   CLOCK: [2020-05-01 Fri 08:40]--[2020-05-01 Fri 09:34] =>  0:54
   CLOCK: [2020-05-01 Fri 07:32]--[2020-05-01 Fri 08:06] =>  0:34
   :END:
** for better output I should still parse the entire buffer,
*** and only log the specified region
*** command could send the line nums













* checkout more examples and find things


* TODO attribute for custom value types (make nullable)
  :LOGBOOK:
  CLOCK: [2020-05-13 Wed 10:40]--[2020-05-13 Wed 11:24] =>  0:44
  CLOCK: [2020-05-13 Wed 10:12]--[2020-05-13 Wed 10:37] =>  0:25
  CLOCK: [2020-05-13 Wed 09:42]--[2020-05-13 Wed 10:08] =>  0:26
  :END:
** custom structs lookup
** get attribute list
** parse attribute list into
*** either string type name ->
*** INamedType sym ? not viable




* everything defaults to referenceType with backing field,

* TODO add everything we encounter in the skeletton dll
** add frozen collections
** also add them to the common types
** add common structs

* move the const rewriter + tests into its own repo
** sharpel just has a reference to it.

* Rewriter cli mode

* sharpel cli mode
